Revit 2026 API

# TriangulationInterfaceForTriangulatedShellComponent Properties

---

The TriangulationInterfaceForTriangulatedShellComponent type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from TriangulationInterface) |

#### Reference

TriangulationInterfaceForTriangulatedShellComponent Class

Autodesk.Revit.DB Namespace